#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```

terraform
data.github_repository.this: Reading...
data.github_repository.this: Read complete after 0s [id=phillies-win-api]
github_repository_environment.this: Refreshing state... [id=phillies-win-api:master]
azurerm_resource_group.this: Refreshing state... [id=/subscriptions/33d036a4-1ab6-407b-a2ef-361bf00ea341/resourceGroups/rg-dkopec-master]
azurerm_log_analytics_workspace.this: Refreshing state... [id=/subscriptions/33d036a4-1ab6-407b-a2ef-361bf00ea341/resourceGroups/rg-dkopec-master/providers/Microsoft.OperationalInsights/workspaces/log-dkopec-master]
azurerm_container_registry.this: Refreshing state... [id=/subscriptions/33d036a4-1ab6-407b-a2ef-361bf00ea341/resourceGroups/rg-dkopec-master/providers/Microsoft.ContainerRegistry/registries/acrdkopecmaster]
github_actions_environment_variable.this["ACA_NAME"]: Refreshing state... [id=phillies-win-api:master:ACA_NAME]
github_actions_environment_variable.this["RG_NAME"]: Refreshing state... [id=phillies-win-api:master:RG_NAME]
github_actions_environment_variable.this["ACR_NAME"]: Refreshing state... [id=phillies-win-api:master:ACR_NAME]
azurerm_container_app_environment.example: Refreshing state... [id=/subscriptions/33d036a4-1ab6-407b-a2ef-361bf00ea341/resourceGroups/rg-dkopec-master/providers/Microsoft.App/managedEnvironments/cae-dkopec-master]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # azurerm_container_app_environment.example must be replaced
-/+ resource "azurerm_container_app_environment" "example" {
      ~ default_domain                   = "wittypebble-3eac630f.eastus.azurecontainerapps.io" -> (known after apply)
      + docker_bridge_cidr               = (known after apply)
      ~ id                               = "/subscriptions/33d036a4-1ab6-407b-a2ef-361bf00ea341/resourceGroups/rg-dkopec-master/providers/Microsoft.App/managedEnvironments/cae-dkopec-master" -> (known after apply)
      ~ log_analytics_workspace_id       = "/subscriptions/33d036a4-1ab6-407b-a2ef-361bf00ea341/resourceGroups/rg-dkopec-master/providers/Microsoft.OperationalInsights/workspaces/log-dkopec-master" # forces replacement -> (known after apply)
      ~ name                             = "cae-dkopec-master" -> "cae-dkopec-2-merge" # forces replacement
      + platform_reserved_cidr           = (known after apply)
      + platform_reserved_dns_ip_address = (known after apply)
      ~ resource_group_name              = "rg-dkopec-master" -> "rg-dkopec-2-merge" # forces replacement
      ~ static_ip_address                = "20.241.232.178" -> (known after apply)
      - tags                             = {} -> null
        # (2 unchanged attributes hidden)
    }

  # azurerm_container_registry.this must be replaced
-/+ resource "azurerm_container_registry" "this" {
      + admin_password                = (sensitive value)
      + admin_username                = (known after apply)
      - anonymous_pull_enabled        = false -> null
      - data_endpoint_enabled         = false -> null
      ~ encryption                    = [
          - {
              - enabled            = false
              - identity_client_id = ""
              - key_vault_key_id   = ""
            },
        ] -> (known after apply)
      ~ id                            = "/subscriptions/33d036a4-1ab6-407b-a2ef-361bf00ea341/resourceGroups/rg-dkopec-master/providers/Microsoft.ContainerRegistry/registries/acrdkopecmaster" -> (known after apply)
      ~ login_server                  = "acrdkopecmaster.azurecr.io" -> (known after apply)
      ~ name                          = "acrdkopecmaster" -> "acrdkopec2merge" # forces replacement
      ~ network_rule_set              = [] -> (known after apply)
      - quarantine_policy_enabled     = false -> null
      ~ resource_group_name           = "rg-dkopec-master" -> "rg-dkopec-2-merge" # forces replacement
      ~ retention_policy              = [
          - {
              - days    = 7
              - enabled = false
            },
        ] -> (known after apply)
      - tags                          = {} -> null
      ~ trust_policy                  = [
          - {
              - enabled = false
            },
        ] -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # azurerm_log_analytics_workspace.this must be replaced
-/+ resource "azurerm_log_analytics_workspace" "this" {
      - cmk_for_query_forced               = false -> null
      ~ id                                 = "/subscriptions/33d036a4-1ab6-407b-a2ef-361bf00ea341/resourceGroups/rg-dkopec-master/providers/Microsoft.OperationalInsights/workspaces/log-dkopec-master" -> (known after apply)
      ~ name                               = "log-dkopec-master" -> "log-dkopec-2-merge" # forces replacement
      ~ primary_shared_key                 = (sensitive value)
      + reservation_capacity_in_gb_per_day = (known after apply)
      ~ resource_group_name                = "rg-dkopec-master" -> "rg-dkopec-2-merge" # forces replacement
      ~ secondary_shared_key               = (sensitive value)
      - tags                               = {} -> null
      ~ workspace_id                       = "fa95b649-0db0-4747-91e4-146feed02250" -> (known after apply)
        # (8 unchanged attributes hidden)
    }

  # azurerm_resource_group.this must be replaced
-/+ resource "azurerm_resource_group" "this" {
      ~ id       = "/subscriptions/33d036a4-1ab6-407b-a2ef-361bf00ea341/resourceGroups/rg-dkopec-master" -> (known after apply)
      ~ name     = "rg-dkopec-master" -> "rg-dkopec-2-merge" # forces replacement
      - tags     = {} -> null
        # (1 unchanged attribute hidden)
    }

  # github_actions_environment_variable.this["ACA_NAME"] must be replaced
-/+ resource "github_actions_environment_variable" "this" {
      ~ created_at    = "2023-04-06 00:56:24 +0000 UTC" -> (known after apply)
      ~ environment   = "master" -> "2-merge" # forces replacement
      ~ id            = "phillies-win-api:master:ACA_NAME" -> (known after apply)
      ~ updated_at    = "2023-04-06 00:56:24 +0000 UTC" -> (known after apply)
      ~ value         = "aca-dkopec-master" -> "aca-dkopec-2-merge"
        # (2 unchanged attributes hidden)
    }

  # github_actions_environment_variable.this["ACR_NAME"] must be replaced
-/+ resource "github_actions_environment_variable" "this" {
      ~ created_at    = "2023-04-06 00:56:25 +0000 UTC" -> (known after apply)
      ~ environment   = "master" -> "2-merge" # forces replacement
      ~ id            = "phillies-win-api:master:ACR_NAME" -> (known after apply)
      ~ updated_at    = "2023-04-06 00:56:25 +0000 UTC" -> (known after apply)
      ~ value         = "acrdkopecmaster" -> "acrdkopec2merge"
        # (2 unchanged attributes hidden)
    }

  # github_actions_environment_variable.this["RG_NAME"] must be replaced
-/+ resource "github_actions_environment_variable" "this" {
      ~ created_at    = "2023-04-06 00:56:23 +0000 UTC" -> (known after apply)
      ~ environment   = "master" -> "2-merge" # forces replacement
      ~ id            = "phillies-win-api:master:RG_NAME" -> (known after apply)
      ~ updated_at    = "2023-04-06 00:56:23 +0000 UTC" -> (known after apply)
      ~ value         = "rg-dkopec-master" -> "rg-dkopec-2-merge"
        # (2 unchanged attributes hidden)
    }

  # github_repository_environment.this must be replaced
-/+ resource "github_repository_environment" "this" {
      ~ environment = "master" -> "2-merge" # forces replacement
      ~ id          = "phillies-win-api:master" -> (known after apply)
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

Plan: 8 to add, 0 to change, 8 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>
*Pushed by: @dkopec, Action: `pull_request`*